# 14.3 US Baby Names 1880-2010

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [6]:
names1880 = pd.read_csv('datasets/baby-names/yob1880.csv',
                        names=['name', 'sex', 'births'])

In [8]:
names1880.head()

        name sex  births
0       Mary   F    7065
1       Anna   F    2604
2       Emma   F    2003
3  Elizabeth   F    1939
4     Minnie   F    1746

In [9]:
names1880.groupby('sex').sum()
# looking the number of birhts in term of gender

     births
sex
F     90993
M    110493

In [ ]:
years = range(1880, 2011)